[
    {
        "ArticleID": "Apple_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Jim Cramer's top 10 things to watch in the stock market Friday",
        "Author": null,
        "Description": "My latest thinking on the stocks of Club names Apple and Nvidia.",
        "URL": "https://www.cnbc.com/2025/01/31/jim-cramers-top-10-things-to-watch-in-the-stock-market-friday.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108054550-1730240946572-gettyimages-2112143030-sg010234_8va4szdc.jpeg?v=1738331114&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-01-31T13:59:10Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  1. Apple's earnings report shows why I always say \"own it, don't trade it.\" Where it has launched Apple Intelligence, the iPhone 16 sells better. High-margin services revenues was better. Mac better. Accessories better. Europe better. India better. Expanding gross margins helped make the numbers, too. Shares are up about 4% Friday.  2. China is still a question mark for Apple, though. Revenues down 11% there in the quarter. Apple Intelligence still needs government approval to launch. Rivals Huawei and Xiaomi can access the AI from buzzy Chinese startup DeepSeek. What can Apple get to reverse its fortunes in China? Will Baidu be its AI partner? 3. The U.S. government is looking into whether DeepSeek used third-parties in Singapore to acquire Nvidia chips that Washington has banned in China, according to Bloomberg News. Club name Nvidia says it plays by the rules in Singapore, and that its revenue from the island country does not indicate diversion.  4. We know Tesla, Club stock Meta and Oracle want all the high-end Nvidia chips they can get, even with DeepSeek's emergence. We don't know about Club names Alphabet or Amazon, which both report next week. What if one of the two says we are reassessing our orders for Nvidia's next-gen AI platform Blackwell? What happens to the stock? What if Amazon, another Club holding, says it's leaning into using AMD? I made a call on Nvidia stock for Club members yesterday.  5. Geopolitics remain part of the Nvidia dilemma. Does DeepSeek have a juicer that can make 10 glasses of orange juice out of a single orange, or does it have 10 government-subsidized juicers that it just won't tell us about? If it is 10 juicers, I worry that President Donald Trump will just ban all semiconductor exports to China.  6. Trump's 25% tariffs on imports from Canada and Mexico, currently set to take effect Saturday, may exclude oil, the president told reporters Thursday night. U.S. oil benchmark WTI was slightly higher Friday, to roughly $73  barrel. The U.S. dollar index strengthened, but it's still below its recent highs set earlier this month.  7. The S&P 500, Nasdaq and Dow Jones Industrial Average were all set to open higher Friday. Stock futures held onto their gains after the Federal Reserve's preferred inflation gauge matched expectations for December. The PCE index rose 0.3% month over month and, when excluding food and energy, 2.8% on an annual basis.  8. Intel showed some cost discipline and improved cash flow in its quarterly results. But the fourth quarter is typically strong for them, and there might have been some pull-through ahead of higher tariffs on Chinese imports. The PC market is weak. JPMorgan and Wells Fargo cut their price targets on the struggling chip stock. Shares added more than 1% Friday.  9. Atlassian shares jumped almost 20% on the back of a very good quarter. The company, which trades under the ticker TEAM, makes pure enterprise software that makes it easier to share and simplify. Seems unstoppable. 10. Vertex Pharmaceuticals' non-opioid painkiller Journavx, which blocks pain signals sent to the brain at their origin. This drug could be a blockbuster, and it's been on my radar for a while now. Vertex shares climbed about 3% Friday.  Sign up for my Top 10 Morning Thoughts on the Market email newsletter for free (See here for a full list of the stocks at Jim Cramer's Charitable Trust.) As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade. THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY, TOGETHER WITH OUR DISCLAIMER.  NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB.  NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Apple_cnbc.com_2",
        "Source": "CNBC",
        "Title": "Huawei revenue grows at fastest pace since 2016 as Chinese telecom giant shrugs off U.S. sanctions",
        "Author": null,
        "Description": "Chinese telecommunications and smartphone giant Huawei continues to grow and take market share from Apple, despite U.S. restrictions.",
        "URL": "https://www.cnbc.com/2025/02/06/china-huawei-revenue-surges-despite-us-sanctions.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108068035-1732609726789-Huawei_MAte_70.png?v=1732609880&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-02-06T03:31:23Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  BEIJING — Chinese telecommunications and smartphone giant Huawei continues to grow and take market share from Apple, despite U.S. restricting the company's access to high-end technology. Huawei's revenue exceeded 860 billion yuan ($118.27 billion) in 2024, Chairman Howard Liang said Wednesday, according to local state media. Huawei did not comment when contacted by CNBC. That's a 22% jump in revenue from 2023, and the fastest growth since a 32% increase in 2016, according to CNBC calculations of publicly released figures. Huawei typically publishes its annual reports in March. Liang, speaking at a local government conference, described Huawei's consumer business as \"returning to growth\" and car solutions business as seeing \"rapid development,\" according to a CNBC translation of the Chinese-language report. He said Huawei's information and communications technology business — which has been the largest segment by revenue — \"remained stable.\" Since 2019, the U.S. has restricted Huawei's ability to access technology from American suppliers, from advanced 5G chips to Google's Android operating system. Huawei's revenue barely grew in 2020, and plunged by nearly 29% in 2021. Its consumer segment was hit hard, and even as revenue rose 17% year on year to 251.5 billion yuan in 2023, it was just over half of what the unit generated at its peak in 2020. Huawei's smartphone shipments in mainland China surged by 37% last year, climbing from fourth to second place by market share, while Apple fell to third place with a 17% drop, according to Canalys data. Vivo, known for its budget-priced devices, ranked first by market share in 2024, the data showed. The telecommunications company started to make a comeback in the smartphone market in 2023 with the release of its Mate 60 Pro in China. Reviews indicated the device offers download speeds associated with 5G — thanks to an advanced semiconductor chip. Just over a year later, Huawei launched the Mate 70 smartphone series that uses the company's first fully self-developed operating system, HarmonyOS NEXT. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Apple_cnbc.com_3",
        "Source": "CNBC",
        "Title": "Britain orders Apple to give it access to encrypted accounts: Washington Post",
        "Author": null,
        "Description": "Apple has been ordered by the U.K. to provide officials access to users' encrypted accounts, the Washington Post reported Friday.",
        "URL": "https://www.cnbc.com/2025/02/07/uk-orders-apple-to-let-it-access-encrypted-accounts-washington-post.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108037243-1726850701034-gettyimages-2172406958-AA_20092024_1866501.jpeg?v=1738927119&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-02-07T12:35:34Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article The U.K. has ordered Apple to provide officials access to users' encrypted accounts, the Washington Post reported Friday. Britain's Home Office, which handles immigration and security, last month issued an order to Apple requiring a technical \"backdoor\" that would allow officials to view fully encrypted material uploaded to the cloud software, the Post reported, citing people familiar with the matter. \"We do not comment on operational matters, including for example confirming or denying the existence of any such notices,\" a Home Office spokesperson. Apple did not immediately respond to a CNBC request for comment. The iPhone maker gives users the ability to store all their photos, messages, documents and more on its encrypted iCloud service — Apple's iCloud is end-to-end encrypted, meaning only the owner of the material can view it. Governments in the U.S., U.K. and EU have long expressed dissatisfaction with this setup, arguing it enables criminals, terrorists and sex offenders to conceal illicit activity. In the U.K., the Investigatory Powers Act of 2016 empowers the government to compel tech companies to weaken their encryption technologies through so-called \"backdoors.\" Tech firms — including Apple — have pushed back on attempts to undermine encryption, saying it would weaken user privacy. Click here to read the full story from the Washington Post. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Apple_cnbc.com_4",
        "Source": "CNBC",
        "Title": "Apple launches app for party invitations in recurring revenue push",
        "Author": null,
        "Description": "Apple on Tuesday introduced a new app for creating event invitations called Apple Invites.",
        "URL": "https://www.cnbc.com/2025/02/04/apple-launches-app-for-party-invitations-in-recurring-revenue-push-.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108027147-17249423442024-08-29t143615z_1073634492_rc2qp9ak6xj0_rtrmadp_0_filmfestival-venice-disclaimer.jpeg?v=1724942390&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-02-04T17:38:53Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Apple on Tuesday released a new app for creating invitations and sending them to contacts. The app is called Apple Invites. Users can create events, such as birthdays, graduations and housewarming parties, and manage RSVPs and guest lists through the app. Apple Invites is also available on the web. While users will not need an iPhone to RSVP to events, they will need a paid iCloud+ subscription to send invites. The launch is the latest example of Apple's services strategy, where the company introduces new paid subscriptions that are marketed to its installed base of 2.35 billion active devices. Apple's Services division has become the company's second-largest business behind the iPhone, reporting $25 billion in sales in the December quarter. Services has also become a big source of Apple's profit, with a gross margin of 74%. The growth of Apple's services division is helping Apple's overall margins expand in recent quarters after years of staying flat. Apple's services business also includes its search deal with Google, Apple Pay payments and device warranties. With Invites, Apple is taking on Partiful, a startup founded in 2020 that allows users to make and send event invites. Partiful posted on social media a joke about Apple's app being a copycat. In a statement, Partiful said that its product is platform-agnostic and can be used regardless of what kind of phone the user or invitee has.  \"With a Shared Photo Album, an interactive comment wall, and ways for guests to connect before, during, and after the event, Partiful has built the most social way to make social plans,\" Partiful said in a statement.  An iCloud+ subscription starts at $1 per month for 50GB of storage, and it is included in Apple's other subscription bundles, ranging up to a $38 per month subscription that also includes the company's TV service, Apple Music and access to games, fitness classes and news. Invites also includes Apple Intelligence, the company's suite of artificial intelligence software. Apple Intelligence can generate images for invites and help write the invitation with the company's Writing Tools. Apple Intelligence also has the ability to share a photo album or playlist with an event's guest list. While Apple does not charge individually for many of its iCloud+ services, it now has a host of paid features intended to get users to upgrade from free storage. That subscription service offers a VPN-style relay service for private browsing, custom email domains for iCloud, local security camera storage and the ability to generate burner emails. Apple does not disclose how many iCloud+ subscribers it has. The company last week said that it has one billion subscribers, but that figure includes subscriptions to apps through the App Store in addition to its direct iCloud subscriptions. WATCH: Tariff impact on Apple: Here's what to know Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Apple_cnbc.com_5",
        "Source": "CNBC",
        "Title": "Apple shares fall 3% in premarket after China reportedly considers probe into App Store practices",
        "Author": null,
        "Description": "China's market regulator is considering whether to open a formal probe into the iPhone giant's App Store fees and policies, Bloomberg reported.",
        "URL": "https://www.cnbc.com/2025/02/05/apple-shares-fall-after-china-reportedly-considers-probe-into-app-store.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108088073-1737074762401-gettyimages-2193895807-img_5767.jpeg?v=1738745944&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-02-05T09:08:03Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Apple shares fell around 1% Wednesday after Bloomberg reported that Chinese regulators are considering whether to open a formal probe into the iPhone giant's App Store fees and policies. The State Administration for Market Regulation (SAMR) is looking into policies that include Apple taking a cut of as much as 30% on in-app spending, as well as blocking third-party payment services and app stores, Bloomberg reported Wednesday, citing people familiar with the matter. China's market regulator has not decided whether to formally open an investigation into Apple, according to the report. Apple and China's Ministry of Commerce was not immediately available for comment when contacted by CNBC. The news comes as trade tensions between the U.S. and China ramp up under the administration of President Donald Trump, one month into his second term. Apple has maintained that its strict App Store policies are designed to protect users and improve the experience across its products. China this week also opened a probe into Google over alleged antitrust violations, although the market regulator did not supply details over the focus of the investigation. The Financial Times reported on Tuesday that the SAMR is also considering a probe into U.S. chipmaker Intel. Apple's App Store has come under scrutiny from regulators globally. It was forced to open up its App Store in Europe, under the sweeping Digital Markets Act in the EU. This means that it now allows non-Apple companies to offer app stores in Europe, and app developers can also use third-party payment systems. If the China probe goes ahead, it would cause further headache for Apple in one of its biggest markets. The Cupertino giant is already facing stiff competition from local players like Huawei that are eating away at its smartphone market share. Apple sales in Greater China declined 11% year-on-year in the December quarter. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_1",
        "Source": "CNBC",
        "Title": "NFL goes after Gen Z fans by courting creators on YouTube, Instagram and Snapchat",
        "Author": null,
        "Description": "Hundreds of creators have swarmed New Orleans for Super Bowl 59, getting paid big contracts to make content for brands like Microsoft, Verizon and Nike.",
        "URL": "https://www.cnbc.com/2025/02/07/nfl-goes-after-gen-z-fans-by-courting-social-media-content-creators.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108098803-1738872529516-IMG_4732.jpeg?v=1738874409&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-02-07T13:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Katie Austin normally publishes fitness content to her Instagram and YouTube channel. But this week, she's been posting a steady trickle of content from New Orleans. That's because Austin, 31, from California, is one of hundreds of creators who have swarmed the Big Easy for Super Bowl 59, getting paid large contracts to make social media content for big-name brands like Electronic Arts and Nike. Austin was sent to New Orleans this week by Snap and the NFL to give her fans a behind-the-scenes look at the Super Bowl. She's also involved in integrations around the games with brands like Microsoft and Verizon, for whom she is hosting a promotional fan event. \"I can reach a lot of people myself,\" said Austin, who has about 2 million followers across all platforms. \"So sending a creator like me to an experience, I am engaging my followers to get that awareness.\" As the 2024 NFL season concludes, viewership and engagement among Generation Z and Generation Alpha has hit a record high, according to the NFL. Austin's role underscores a new reality where online creators are treated just like traditional celebrities, in an attempt to attract younger audiences to football. The NFL has made this push in partnership with social apps like YouTube and Snapchat, highlighting the league's evolving marketing strategies that are increasingly focused on digitally native audiences. \"You start to look at these different cohorts of fans, especially the ones that are a little more difficult to reach through linear and you start to see the role in which creators can play and broaden that audience,\" said Ian Trombetta, NFL senior vice president of social, influencer and creator marketing.  For this year's Super Bowl, featuring the Kansas City Chiefs and Philadelphia Eagles, brands like Nike and EA are sponsoring creators to attend the event and post content. Austin didn't say how much she's getting paid for the content she's making at Super Bowl 59, but some brands have signed deals of up to six figures with some creators to promote the event, said Victoria Bachan, global president of Sixteenth, a creator talent management company. \"You can no longer really have a media strategy for tentpole opportunities like this that do not include a creator level,\" said Bachan. Brands are increasing their spending on influencer activations for this year's Super Bowl between 25% and 35%, and they're diverting funds from traditional TV-only advertising to do so, according to a study by Captiv8, an influencer marketing platform. The push for creators comes after concerns about younger audiences' lack of interest in sports had grown. A 2022 Emory Goizueta Business School study found that 27% of Gen Z identify as \"anti-sports,\" compared with 7% of millennials and 5% of Generation X. The NFL's push to engage creators, which began in 2019, has already paid off. The percentage of Gen Z and Gen A who identify as fans has grown steadily for the last three years to an all-time high as the league's investment in creators has grown, according to the NFL. Besides Austin, Snapchat sent a handful of other creators to the Super Bowl to post behind-the-scenes content using augmented reality filters. Meanwhile, YouTube, which secured a $2 billion-per-year deal for the rights to \"NFL Sunday Ticket\" in 2022, has established itself as pivotal to connecting the league with digital audiences. This year, YouTube will debut as the first official sponsor of the Super Bowl Tailgate, which will feature events with top creators like Kristy and Desmond Scott and a livestreamed performance by rapper Post Malone before the game on Sunday. To adapt to these changes, the NFL has eased up on restrictions around the use of official league footage by creators on their YouTube channels.  The league and YouTube in January expanded their \"Access Pass\" program to allow retired NFL players like Cam Newton, Jason Kelce and Kurt Benkert to use league footage in their videos.  \"There's this pathway now that certainly did not exist five to 10 years ago,\" Trombetta said. \"It's really cool especially as these athletes showcase more of their personalities off the field.\" WATCH: Meta the 'most consequential' company in the world: Futurum CEO Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_2",
        "Source": "CNBC",
        "Title": "Microsoft stock slumps 5% on disappointing revenue outlook",
        "Author": null,
        "Description": "Microsoft shares dropped 5% despite topping fiscal second-quarter estimates due to weak guidance.",
        "URL": "https://www.cnbc.com/2025/01/30/microsoft-stock-slumps-on-disappointing-revenue-outlook.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108090594-1737562586757-9GSqwC8c.jpg?v=1737563003&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-01-30T15:05:10Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Microsoft shares dropped 6.2% after issuing weak current-quarter guidance after the bell Wednesday. The software giant topped Wall Street's fiscal second-quarter estimates, posting earnings of $3.23 per share on $69.63 billion in revenue. That surpassed the earnings per share of $3.11 and $68.78 billion in revenue forecast by analysts polled by LSEG. Shares registered their worst day since October 2022. The decline came as Microsoft finance chief Amy Hood said the company expects revenues for the current quarter to range between $67.7 billion and $68.7 billion, falling short of the $69.78 billion, per LSEG. Revenue grew 12.3% year over year, the slowest growth since the middle of 2023. Microsoft also posted a slowdown in growth in its Azure and other cloud services revenues. The segment was up 31%, down from 33% in the prior quarter. Many Wall Street analysts stood by the technology behemoth despite the disappointing guide and Azure slowdown. Goldman Sachs analyst Kash Rangan called the company \"well-positioned\" to continue benefiting from artificial intelligence adoption and among the \"most compelling investment opportunities\" in the industry. \"Microsoft has proven they can drive a Cloud business, and now they have shown they can drive the largest AI business via a combination of high-quality Gen AI inferencing and Gen AI apps,\" wrote Bernstein's Mark Moerdler, adding that management needs to pivot toward the core Azure business independent of AI. Microsoft shares dipped 2% during Monday's session as part of a broader tech sector sell-off. The drop came as Wall Street assessed the fallout from DeepSeek's AI models. Estimates suggest the China startup trained its open-source model at a fraction of the costs for other competing U.S. products. Microsoft CEO Satya Nadella said during the earnings call that DeepSeek's R1 model is currently available through GitHub and the company's Azure AI Foundry. It will also eventually be accessible on Copilot+ PCs, he said. Other technology stocks saw strong gains during Thursday's trading session on the back of earnings. Meta Platforms jumped nearly 4% on strong results, while Tesla edged up despite missing estimates and reporting a decline in automotive revenue. IBM popped 14% on robust results and notable gains in its software business as AI demand grows. Microsoft is down 1.5% since the start of 2025. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_3",
        "Source": "CNBC",
        "Title": "Reid Hoffman enters 'wondrous and terrifying' world of health care with latest AI startup",
        "Author": null,
        "Description": "LinkedIn founder and venture capitalist Reid Hoffman has just launched drug discovery startup Manas AI, alongside Dr. Siddhartha Mukherjee, an oncologist.",
        "URL": "https://www.cnbc.com/2025/02/02/reid-hoffman-launches-manas-ai-a-new-drug-discovery-startup.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108050948-1729604245524-gettyimages-2179195421-AFP_36KJ9Q6.jpeg?v=1738344856&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-02-02T13:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  LinkedIn co-founder and venture capitalist Reid Hoffman became a billionaire from his business social-working company, and has made lucrative bets on companies including Airbnb and Zynga while also backing nuclear fusion startup Helion Energy. Now Hoffman is diving into the health care, which he describes as \"wondrous and terrifying,\" with his latest startup, Manas AI.  Hoffman and Dr. Siddhartha Mukherjee, an oncologist and Pulitzer Prize-winning author, unveiled the company on Monday. Manas will use artificial intelligence to try and accelerate the drug discovery process, starting with new treatments for aggressive cancers like prostate cancer, lymphoma and triple-negative breast cancer.  Developing new drugs is traditionally a costly and complex process. It can take more than 10 years and cost billions of dollars to develop a single medication, according to a report from Deloitte. Manas said it will use its proprietary chemical libraries and AI-powered filters to identify drug candidates more quickly, ideally reducing the decades-long discovery process to just a few years. \"Most people have had friends, family members, etc., who've died from cancer or had serious cancer problems,\" Hoffman told CNBC in an interview this week. \"If we can make a huge difference on this, and this is the kind of thing that AI can make a huge difference in, it's the kind of reason why AI can be great for humanity.\" Manas raised $24.6 million in seed funding, led by General Catalyst and Hoffman with participation from Greylock, where he is a partner. Hoffman has been deep in AI in recent years. He was an early investor in OpenAI, when the project was still a nonprofit, and he helped start Inflection AI along with DeepMind co-founder Mustafa Suleyman. Last year, Suleyman joined Microsoft, where Hoffman is a board member, as CEO of a new unit called Microsoft AI. Several Inflection employees joined him. Manas has also inked a partnership with Microsoft, and will leverage its Azure cloud-computing platform. Hoffman, who sold LinkedIn to Microsoft for $27 billion, said Manas is deploying several additional tools from Microsoft as well, including some that are not generally available to the public yet.  Hoffman has been working with Mukherjee to create Manas for about a year, though the process picked up steam in the last couple months. Hoffman said the team felt ready to publicly share its ambitions this week since its baseline, foundational resources are in order.  The company has a long road ahead, and the drug discovery market is very competitive. Other startups along with major pharmaceutical companies like Eli Lilly, Pfizer and Merck, are also exploring how to leverage AI to accelerate drug research and development.   Hoffman said he feels confident in Manas's approach, though he would be \"totally delighted\" to see multiple companies flourish.  \"We also bring the thing that a startup usually brings, which is a willingness to go very hard, abandon things quickly that aren't working,\" he said. \"Live like this week matters, and the result of this week matters.\"  Following Manas's launch on Monday, five different potential strategic partners have already approached the company, Hoffman said.   Hoffman said the company is in \"build quickly\" and \"learn and deploy\" mode. One of its early initiatives is called Project Cosmos, which is an effort to map out the fundamental rules of drug binding, according to the company's website. Hoffman declined to share any additional details about the project.  Manas currently has just four employees – including Hoffman and Mukherjee – but Hoffman said it will grow. He's been acting as the company's \"AI guy\" while Mukherjee serves as the \"bio guy,\" he said. Ultimately, Manas is about melding the two fields.   \"It isn't just the best of science and it isn't just the best of AI, because either of those two are insufficient,\" Hoffman said. \"You need to put those two together.\" As the AI guy, Hoffman was paying close attention this week to the sudden emergence of China's DeepSeek in the U.S. DeepSeek began generating buzz in January, when the startup released its open-source reasoning model R1, which rivals OpenAI's o1. The model was reportedly developed at a fraction of the cost of rival models by OpenAI, Anthropic, Google and others. Hoffman said that while DeepSeek might encourage American companies to pick up the pace and share their plans sooner, the new revelations don't suggest that large models are a bad investment. \"The competition game is on,\" he said, \"But I don't think it's the 'Oh my God, we're losing!' as American technology.\" WATCH: LinkedIn co-founder Reid Hoffman on DeepSeek Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_4",
        "Source": "CNBC",
        "Title": "Google opens its most powerful AI models to everyone, the next stage in its virtual agent push",
        "Author": null,
        "Description": "The suite of agentic Gemini 2.0 models includes 2.0 Flash, 2.0 Pro Experimental and 2.0 Flash-Lite.",
        "URL": "https://www.cnbc.com/2025/02/05/google-opens-gemini-2point0-its-most-powerful-ai-model-to-everyone.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108097838-1738771746886-108097838-1738771466930-gettyimages-2189492706-vcg111536239153-1.jpg?v=1738771775&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-02-05T16:06:05Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Google on Wednesday released Gemini 2.0 — its \"most capable\" artificial intelligence model suite yet — to everyone. In December, the company gave access to developers and trusted testers, as well as wrapping some features into Google products, but this is a \"general release,\" according to Google. The suite of models includes 2.0 Flash, which is billed as a \"workhorse model, optimal for high-volume, high-frequency tasks at scale,\" as well as 2.0 Pro Experimental for coding performance, and 2.0 Flash-Lite, which the company calls its \"most cost-efficient model yet.\" Gemini Flash costs developers 10 cents per million tokens for text, image and video inputs, while Flash-Lite, its more cost-effective version, costs 0.75 of a cent for the same. Tokens refer to each individual unit of data that the model processes. The continued releases are part of a broader strategy for Google of investing heavily into AI agents as the AI arms race heats up among tech giants and startups alike. Meta, Amazon, Microsoft, OpenAI and Anthropic are also moving toward agentic AI, or models that can complete complex multistep tasks on a user's behalf, rather than a user having to walk them through every individual step. \"Over the last year, we have been investing in developing more agentic models, meaning they can understand more about the world around you, think multiple steps ahead, and take action on your behalf, with your supervision,\" Google wrote in a December blog post, adding that Gemini 2.0 has \"new advances in multimodality — like native image and audio output — and native tool use,\" and that the family of models \"will enable us to build new AI agents that bring us closer to our vision of a universal assistant.\" Anthropic, the Amazon-backed AI startup founded by ex-OpenAI research executives, is a key competitor in the race to develop AI agents. In October, Anthropic said its AI agents were able to use computers like humans to complete complex tasks. Anthropic's computer use capability allows its technology to interpret what's on a computer screen, select buttons, enter text, navigate websites and execute tasks through any software and real-time internet browsing, the startup said. The tool can \"use computers in basically the same way that we do,\" Jared Kaplan, Anthropic's chief science officer, told CNBC in an interview at the time. He said it can do tasks with \"tens or even hundreds of steps.\" OpenAI released a similar feature recently called Operator that will automate tasks such as planning vacations, filling out forms, making restaurant reservations and ordering groceries. The Microsoft-backed startup described Operator as \"an agent that can go to the web to perform tasks for you.\" Earlier this week, OpenAI introduced Deep Research, which allows an AI agent to compile complex research reports and analyze questions and topics of the user's choice. Google in December launched a similar tool of the same name — Deep Research — which acts as a \"research assistant, exploring complex topics and compiling reports on your behalf.\" CNBC first reported in December that Google would introduce several AI features early in 2025. \"In history, you don't always need to be first but you have to execute well and really be the best in class as a product,\" CEO Sundar Pichai said in a strategy meeting at the time. \"I think that's what 2025 is all about.\" Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_5",
        "Source": "CNBC",
        "Title": "SoftBank commits to joint venture with OpenAI, will spend $3 billion per year on OpenAI's tech",
        "Author": null,
        "Description": "SoftBank has committed to spending $3 billion per year to use OpenAI's tech, according to a joint release released on Monday.",
        "URL": "https://www.cnbc.com/2025/02/03/softbank-commits-to-joint-venture-with-openai.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108070147-1733174395033-gettyimages-2187409024-avils-notitle241202_npdaP.jpeg?v=1734629855&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-02-03T05:35:39Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article SoftBank has committed to spending $3 billion per year for itself and its subsidiaries to use OpenAI's tech, according to a joint announcement on Monday. The two also announced a new joint venture, billed as \"SB OpenAI Japan,\" which will market OpenAI's enterprise tech exclusively to major companies in Japan. The deal will give SoftBank and its subsidiaries access to ChatGPT Enterprise, OpenAI's API, custom models and agent products such as Operator, which it describes as \"an agent that can go to the web to perform tasks for you,\" such as planning vacations and filling out forms. It also will include access to OpenAI's newest agent feature, once it launches: a tool called \"Deep Research\" which OpenAI says will be able to conduct multistep analysis on the web. SoftBank branded all the OpenAI products it will use as a suite of tools \"Cristal Intelligence.\" Arm, the British chip designer acquired by SoftBank in 2016, will also use OpenAI tools to \"boost productivity across the company,\" according to the announcement. At a livestreamed event early Monday morning, which was jointly held by SoftBank, SoftBank Group, OpenAI and Arm, executives in the audience represented companies that collectively accounted for more than half of Japan's total market capitalization, according to SoftBank. During the presentation, SoftBank CEO Masayoshi Son said that he believes artificial general intelligence, or AGI — a vaguely defined benchmark referring to AI that equals or surpasses human intellect on a wide range of tasks — will be a reality in fewer than 10 years. Son said via a translator that he believes \"AGI can be achieved in large enterprise businesses first,\" adding that to achieve it, \"quite the huge amount of money is necessary\" and that such funds are \"only available in large enterprises at the moment.\"  News of SoftBank and OpenAI's strategic partnership comes days after CNBC confirmed that OpenAI is in talks to raise up to $40 billion in a funding round led by Son's SoftBank at a potential valuation of $300 billion, according to a source familiar, who amended the recently reported $340 billion figure. SoftBank would contribute between $15 billion and $25 billion, according to two people familiar with the negotiations who asked not to be named because the talks are ongoing. If the round were completed, SoftBank would surpass Microsoft as OpenAI's top backer. Part of the funding may be used for OpenAI's commitment to Stargate, a joint venture between SoftBank, OpenAI and Oracle that was introduced by President Donald Trump last month, the sources said. The plan calls for billions of dollars to be invested in U.S. AI infrastructure. During the presentation Monday morning, Son said he was looking forward to working with OpenAI, Oracle and others on the Stargate project. OpenAI was last valued at $157 billion by private investors. In late 2022, the company launched its ChatGPT chatbot, kicking off a boom in generative AI. OpenAI closed its latest $6.6 billion round in October, gearing up to aggressively compete with Elon Musk's xAI, as well as Microsoft, Google, Amazon and Anthropic. Meanwhile, Chinese startup lab DeepSeek has gone viral in the U.S, presenting fresh competition to OpenAI. DeepSeek saw its app soar to the top of Apple's App Store rankings last week and roiled U.S. markets on reports that its powerful model was trained at a fraction of the cost of U.S. competitors. At an event in Washington, D.C., on Thursday hosted by OpenAI, CEO Sam Altman said DeepSeek is \"clearly a great model.\" \"This is a reminder of the level of competition and the need for democratic Al to win,\" he said. He said it also points to the \"level of interest in reasoning, the level of interest in open source.\" Correction: This article has been updated to correct when Stargate was introduced and when DeepSeek soared to the top of Apple's App Store rankings. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    }
]