[
    {
        "ArticleID": "Apple_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Jim Cramer's top 10 things to watch in the stock market Friday",
        "Author": null,
        "Description": "My latest thinking on the stocks of Club names Apple and Nvidia.",
        "URL": "https://www.cnbc.com/2025/01/31/jim-cramers-top-10-things-to-watch-in-the-stock-market-friday.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108054550-1730240946572-gettyimages-2112143030-sg010234_8va4szdc.jpeg?v=1738331114&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Apple",
        "TimePub": "2025-01-31T13:59:10Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  1. Apple's earnings report shows why I always say \"own it, don't trade it.\" Where it has launched Apple Intelligence, the iPhone 16 sells better. High-margin services revenues was better. Mac better. Accessories better. Europe better. India better. Expanding gross margins helped make the numbers, too. Shares are up about 4% Friday.  2. China is still a question mark for Apple, though. Revenues down 11% there in the quarter. Apple Intelligence still needs government approval to launch. Rivals Huawei and Xiaomi can access the AI from buzzy Chinese startup DeepSeek. What can Apple get to reverse its fortunes in China? Will Baidu be its AI partner? 3. The U.S. government is looking into whether DeepSeek used third-parties in Singapore to acquire Nvidia chips that Washington has banned in China, according to Bloomberg News. Club name Nvidia says it plays by the rules in Singapore, and that its revenue from the island country does not indicate diversion.  4. We know Tesla, Club stock Meta and Oracle want all the high-end Nvidia chips they can get, even with DeepSeek's emergence. We don't know about Club names Alphabet or Amazon, which both report next week. What if one of the two says we are reassessing our orders for Nvidia's next-gen AI platform Blackwell? What happens to the stock? What if Amazon, another Club holding, says it's leaning into using AMD? I made a call on Nvidia stock for Club members yesterday.  5. Geopolitics remain part of the Nvidia dilemma. Does DeepSeek have a juicer that can make 10 glasses of orange juice out of a single orange, or does it have 10 government-subsidized juicers that it just won't tell us about? If it is 10 juicers, I worry that President Donald Trump will just ban all semiconductor exports to China.  6. Trump's 25% tariffs on imports from Canada and Mexico, currently set to take effect Saturday, may exclude oil, the president told reporters Thursday night. U.S. oil benchmark WTI was slightly higher Friday, to roughly $73  barrel. The U.S. dollar index strengthened, but it's still below its recent highs set earlier this month.  7. The S&P 500, Nasdaq and Dow Jones Industrial Average were all set to open higher Friday. Stock futures held onto their gains after the Federal Reserve's preferred inflation gauge matched expectations for December. The PCE index rose 0.3% month over month and, when excluding food and energy, 2.8% on an annual basis.  8. Intel showed some cost discipline and improved cash flow in its quarterly results. But the fourth quarter is typically strong for them, and there might have been some pull-through ahead of higher tariffs on Chinese imports. The PC market is weak. JPMorgan and Wells Fargo cut their price targets on the struggling chip stock. Shares added more than 1% Friday.  9. Atlassian shares jumped almost 20% on the back of a very good quarter. The company, which trades under the ticker TEAM, makes pure enterprise software that makes it easier to share and simplify. Seems unstoppable. 10. Vertex Pharmaceuticals' non-opioid painkiller Journavx, which blocks pain signals sent to the brain at their origin. This drug could be a blockbuster, and it's been on my radar for a while now. Vertex shares climbed about 3% Friday.  Sign up for my Top 10 Morning Thoughts on the Market email newsletter for free (See here for a full list of the stocks at Jim Cramer's Charitable Trust.) As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade. THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY, TOGETHER WITH OUR DISCLAIMER.  NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB.  NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Microsoft_cnbc.com_1",
        "Source": "CNBC",
        "Title": "NFL goes after Gen Z fans by courting creators on YouTube, Instagram and Snapchat",
        "Author": null,
        "Description": "Hundreds of creators have swarmed New Orleans for Super Bowl 59, getting paid big contracts to make content for brands like Microsoft, Verizon and Nike.",
        "URL": "https://www.cnbc.com/2025/02/07/nfl-goes-after-gen-z-fans-by-courting-social-media-content-creators.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108098803-1738872529516-IMG_4732.jpeg?v=1738874409&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Microsoft",
        "TimePub": "2025-02-07T13:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Katie Austin normally publishes fitness content to her Instagram and YouTube channel. But this week, she's been posting a steady trickle of content from New Orleans. That's because Austin, 31, from California, is one of hundreds of creators who have swarmed the Big Easy for Super Bowl 59, getting paid large contracts to make social media content for big-name brands like Electronic Arts and Nike. Austin was sent to New Orleans this week by Snap and the NFL to give her fans a behind-the-scenes look at the Super Bowl. She's also involved in integrations around the games with brands like Microsoft and Verizon, for whom she is hosting a promotional fan event. \"I can reach a lot of people myself,\" said Austin, who has about 2 million followers across all platforms. \"So sending a creator like me to an experience, I am engaging my followers to get that awareness.\" As the 2024 NFL season concludes, viewership and engagement among Generation Z and Generation Alpha has hit a record high, according to the NFL. Austin's role underscores a new reality where online creators are treated just like traditional celebrities, in an attempt to attract younger audiences to football. The NFL has made this push in partnership with social apps like YouTube and Snapchat, highlighting the league's evolving marketing strategies that are increasingly focused on digitally native audiences. \"You start to look at these different cohorts of fans, especially the ones that are a little more difficult to reach through linear and you start to see the role in which creators can play and broaden that audience,\" said Ian Trombetta, NFL senior vice president of social, influencer and creator marketing.  For this year's Super Bowl, featuring the Kansas City Chiefs and Philadelphia Eagles, brands like Nike and EA are sponsoring creators to attend the event and post content. Austin didn't say how much she's getting paid for the content she's making at Super Bowl 59, but some brands have signed deals of up to six figures with some creators to promote the event, said Victoria Bachan, global president of Sixteenth, a creator talent management company. \"You can no longer really have a media strategy for tentpole opportunities like this that do not include a creator level,\" said Bachan. Brands are increasing their spending on influencer activations for this year's Super Bowl between 25% and 35%, and they're diverting funds from traditional TV-only advertising to do so, according to a study by Captiv8, an influencer marketing platform. The push for creators comes after concerns about younger audiences' lack of interest in sports had grown. A 2022 Emory Goizueta Business School study found that 27% of Gen Z identify as \"anti-sports,\" compared with 7% of millennials and 5% of Generation X. The NFL's push to engage creators, which began in 2019, has already paid off. The percentage of Gen Z and Gen A who identify as fans has grown steadily for the last three years to an all-time high as the league's investment in creators has grown, according to the NFL. Besides Austin, Snapchat sent a handful of other creators to the Super Bowl to post behind-the-scenes content using augmented reality filters. Meanwhile, YouTube, which secured a $2 billion-per-year deal for the rights to \"NFL Sunday Ticket\" in 2022, has established itself as pivotal to connecting the league with digital audiences. This year, YouTube will debut as the first official sponsor of the Super Bowl Tailgate, which will feature events with top creators like Kristy and Desmond Scott and a livestreamed performance by rapper Post Malone before the game on Sunday. To adapt to these changes, the NFL has eased up on restrictions around the use of official league footage by creators on their YouTube channels.  The league and YouTube in January expanded their \"Access Pass\" program to allow retired NFL players like Cam Newton, Jason Kelce and Kurt Benkert to use league footage in their videos.  \"There's this pathway now that certainly did not exist five to 10 years ago,\" Trombetta said. \"It's really cool especially as these athletes showcase more of their personalities off the field.\" WATCH: Meta the 'most consequential' company in the world: Futurum CEO Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Alphabet_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Alphabet to report Q4 earnings after the bell Tuesday",
        "Author": null,
        "Description": "Google is slated to report fourth-quarter earnings on Tuesday after the close of regular trading.",
        "URL": "https://www.cnbc.com/2025/02/04/alphabet-q4-earnings-report-2024.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108095056-17382610492024-02-15t141013z_655279572_rc2x26abo6x9_rtrmadp_0_google-france.jpeg?v=1738261131&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Alphabet",
        "TimePub": "2025-02-04T17:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Alphabet shares fell more than 9% in after-hours trading Tuesday after the company reported fourth-quarter results that missed on revenue expectations and announced more artificial intelligence investments. Earnings per share for the Google parent company beat analysts' estimates by two cents. Here are the numbers: Here are other numbers Wall Street was watching: Alphabet's overall revenue grew nearly 12% year over year, compared to more than 13% growth in the same quarter last year. The company's revenue growth, as well as growth for its search business, its YouTube ads business and its services unit were all slower compared to a year ago. Google's advertising revenue growth was 10.6%, compared to 11% a year ago. Search revenue growth was 12.5%, compared to 12.7% in the fourth quarter of last year. YouTube ads revenue growth was 13.8% compared to 15.5% a year ago, and growth for the company's services business was 10.2%, compared to 12.4% a year ago. The company also announced that it plans to invest $75 billion in capital expenditures in 2025 as it continues to expand on its AI strategy. That is above the $58.84 billion that Wall Street expected, according to FactSet. Alphabet said it expects capital expenditures for the first quarter to come in between $16 billion and $18 billion, which was also higher than the $14.3 billion that was expected, per FactSet. Alphabet's capital expenditure for the quarter was $14 billion, which is higher than the $13.26 billion Wall Street was expecting, according to StreetAccount. Chief Financial Officer Anat Ashkenazi said on an earnings call with investors that the figure primarily reflects the company's investment in its technical infrastructure, with the largest component being investments in servers, followed by data centers \"to support the growth of our business across Google Services, Google Cloud and Google DeepMind.\" The company's fourth-quarter net income increased more than 28% to $26.54 billion from $20.69 billion a year prior. Alphabet also reported disappointing cloud revenue at $11.96 billion during the quarter, compared to $12.19 billion, expected by Wall Street. Despite the miss, the cloud unit's revenue increased 30% from the year prior. Alphabet has been drawing profit from the cloud business as it tries to keep up with market leaders Amazon Web Services and Microsoft Azure. Asked if revenue for the company's cloud unit could have been higher with more compute capacity, Ashkenazi said the company had strong demand for AI products in the fourth quarter, and that it \"exited the year with more demand than we had available capacity.\" \"We are in a tight supply-demand situation, working very hard to bring more capacity online,\" Ashkenazi continued, saying the company will be adding more capacity throughout the year. Alphabet's Other Bets segment, which includes the company's life sciences unit Verily and self-driving car unit Waymo, reported revenue of $400 million in the fourth quarter. That came behind Wall Street's expectations of $616.4 million, according to StreetAccount, and it was down more than 39% from $657 million in the same quarter last year. The company made a series of announcements in the fourth quarter related to Waymo, showing confidence in its ability to commercialize its self-driving car company more quickly. Waymo's robotaxi service now operates in Los Angeles, San Francisco and Phoenix, covering more than 500 square miles of public roads. In December, the company said it plans to launch its commercial service in Austin, Texas, and through the Uber app in Austin and Atlanta in 2025. The company also announced that it will begin testing Waymo in Tokyo, its first international expansion. WATCH: Twenty years in, Google Maps turns to AI to maintain dominance Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Alphabet_bloomberg.com_1",
        "Source": "Bloomberg",
        "Title": "Ambanis win bid for 49% stake in Oval Invincibles cricket team",
        "Author": "Bloomberg",
        "Description": "This strengthens the Hundred format in the UK and may open doors for Indian players, boosting TV viewership.",
        "URL": "https://www.bloomberg.com/news/articles/2025-01-30/ambani-family-buys-stake-in-london-cricket-team-oval-invincibles",
        "ImageURL": "https://bl-i.thgim.com/public/todays-paper/tp-others/lpp3s5/article66224387.ece/alternates/LANDSCAPE_1200/Shivkumar_Corp_G3TAJ8B8U.5.jpg.jpg",
        "Industry": "Technology",
        "Company": "Alphabet",
        "TimePub": "2025-01-30T18:25:19Z",
        "Summary": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Oval Invincibles celebrate during The Hundred Final in August 2024. The billionaire Ambani family won the bidding battle for a stake in the Oval Invincibles cricket team in London, after interest from private equity firms and Silicon Valley executives.  The Indian family, which also own the Mumbai Indians franchise in their home country’s lucrative league, will take a 49% holding in the team, according to a person familiar with the matter."
    },
    {
        "ArticleID": "NVIDIA_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Jim Cramer's top 10 things to watch in the stock market Friday",
        "Author": null,
        "Description": "My latest thinking on the stocks of Club names Apple and Nvidia.",
        "URL": "https://www.cnbc.com/2025/01/31/jim-cramers-top-10-things-to-watch-in-the-stock-market-friday.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108054550-1730240946572-gettyimages-2112143030-sg010234_8va4szdc.jpeg?v=1738331114&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "NVIDIA",
        "TimePub": "2025-01-31T13:59:10Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  1. Apple's earnings report shows why I always say \"own it, don't trade it.\" Where it has launched Apple Intelligence, the iPhone 16 sells better. High-margin services revenues was better. Mac better. Accessories better. Europe better. India better. Expanding gross margins helped make the numbers, too. Shares are up about 4% Friday.  2. China is still a question mark for Apple, though. Revenues down 11% there in the quarter. Apple Intelligence still needs government approval to launch. Rivals Huawei and Xiaomi can access the AI from buzzy Chinese startup DeepSeek. What can Apple get to reverse its fortunes in China? Will Baidu be its AI partner? 3. The U.S. government is looking into whether DeepSeek used third-parties in Singapore to acquire Nvidia chips that Washington has banned in China, according to Bloomberg News. Club name Nvidia says it plays by the rules in Singapore, and that its revenue from the island country does not indicate diversion.  4. We know Tesla, Club stock Meta and Oracle want all the high-end Nvidia chips they can get, even with DeepSeek's emergence. We don't know about Club names Alphabet or Amazon, which both report next week. What if one of the two says we are reassessing our orders for Nvidia's next-gen AI platform Blackwell? What happens to the stock? What if Amazon, another Club holding, says it's leaning into using AMD? I made a call on Nvidia stock for Club members yesterday.  5. Geopolitics remain part of the Nvidia dilemma. Does DeepSeek have a juicer that can make 10 glasses of orange juice out of a single orange, or does it have 10 government-subsidized juicers that it just won't tell us about? If it is 10 juicers, I worry that President Donald Trump will just ban all semiconductor exports to China.  6. Trump's 25% tariffs on imports from Canada and Mexico, currently set to take effect Saturday, may exclude oil, the president told reporters Thursday night. U.S. oil benchmark WTI was slightly higher Friday, to roughly $73  barrel. The U.S. dollar index strengthened, but it's still below its recent highs set earlier this month.  7. The S&P 500, Nasdaq and Dow Jones Industrial Average were all set to open higher Friday. Stock futures held onto their gains after the Federal Reserve's preferred inflation gauge matched expectations for December. The PCE index rose 0.3% month over month and, when excluding food and energy, 2.8% on an annual basis.  8. Intel showed some cost discipline and improved cash flow in its quarterly results. But the fourth quarter is typically strong for them, and there might have been some pull-through ahead of higher tariffs on Chinese imports. The PC market is weak. JPMorgan and Wells Fargo cut their price targets on the struggling chip stock. Shares added more than 1% Friday.  9. Atlassian shares jumped almost 20% on the back of a very good quarter. The company, which trades under the ticker TEAM, makes pure enterprise software that makes it easier to share and simplify. Seems unstoppable. 10. Vertex Pharmaceuticals' non-opioid painkiller Journavx, which blocks pain signals sent to the brain at their origin. This drug could be a blockbuster, and it's been on my radar for a while now. Vertex shares climbed about 3% Friday.  Sign up for my Top 10 Morning Thoughts on the Market email newsletter for free (See here for a full list of the stocks at Jim Cramer's Charitable Trust.) As a subscriber to the CNBC Investing Club with Jim Cramer, you will receive a trade alert before Jim makes a trade. Jim waits 45 minutes after sending a trade alert before buying or selling a stock in his charitable trust's portfolio. If Jim has talked about a stock on CNBC TV, he waits 72 hours after issuing the trade alert before executing the trade. THE ABOVE INVESTING CLUB INFORMATION IS SUBJECT TO OUR TERMS AND CONDITIONS AND PRIVACY POLICY, TOGETHER WITH OUR DISCLAIMER.  NO FIDUCIARY OBLIGATION OR DUTY EXISTS, OR IS CREATED, BY VIRTUE OF YOUR RECEIPT OF ANY INFORMATION PROVIDED IN CONNECTION WITH THE INVESTING CLUB.  NO SPECIFIC OUTCOME OR PROFIT IS GUARANTEED. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Meta_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Instagram tests Reels pause feature as TikTok remains in limbo",
        "Author": null,
        "Description": "Meta is testing a pause feature with a small group of users on Instagram Reels.",
        "URL": "https://www.cnbc.com/2025/01/30/instagram-tests-reels-pause-feature-as-tiktok-remains-in-limbo.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/107267663-1688664426874-gettyimages-1227953951-roy-notitle200807_npm6w.jpeg?v=1738263540&w=1920&h=1080",
        "Industry": "Technology",
        "Company": "Meta",
        "TimePub": "2025-01-30T23:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Meta is testing a long-awaited pause feature on Instagram Reels that will allow users to start and stop videos with just one tap. The new feature is the latest sign that Meta is looking to capitalize on TikTok's uncertain future in the U.S. after it briefly went dark earlier this month. The popular short-form video app, which is owned by the Chinese company ByteDance, could be banned for good on April 5 and is still unavailable on the Apple and Google app stores. The pause feature is currently available to a small group of users around the globe, Meta said. The company was unable to specify when it will roll out more broadly. Previously, Instagram users have only been able to pause videos on Instagram Reels by tapping and holding on their screen, requiring more work than simply tapping the screen to pause on TikTok. Previously, one tap on Instagram Reels would mute a video's audio, but the video would continue to play. On Thursday, CNBC was able to pause Instagram Reels videos with a single tap. Thousands of users have left comments and taken to other social media to lobby for a Reels pause button. \"Hello @instagram, can I please request a pause button on reels?? sincerely, a grieving former TikTok scroller,\" one user posted on social media site X while TikTok was offline for a few hours in the U.S. earlier this month. Besides the Reels pause button, Meta this month has announced a new video editing app called Edits that will compete directly with ByteDance's CapCut editing app. Edits will launch in February, Instagram chief Adam Mosseri said in a post. Meta is also paying creators to promote Instagram on TikTok, Snapchat, YouTube Shorts and other short-form video platforms, CNBC reported Sunday. Shares of Meta are up slightly on Thursday, a day after the company reported fourth-quarter earnings that beat analysts' estimates on the top and bottom lines. \"We're going to learn what's going to happen with TikTok, and regardless of that, I expect Reels on Instagram and Facebook to continue growing,\" Meta CEO Mark Zuckerberg said on a call with analysts Wednesday. WATCH: The big winner from a TikTok closure in the U.S. is Meta and X: Heroic Ventures' Michael Fertik Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Pfizer_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Vaccine stocks fall as Senate panel advances RFK Jr.'s nomination for HHS secretary",
        "Author": null,
        "Description": "Shares of Moderna, BioNTech, Novavax, GSK and Pfizer fell on Tuesday following the vote.",
        "URL": "https://www.cnbc.com/2025/02/04/vaccine-stocks-fall-as-senate-advances-rfk-jr-hhs-nomination.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108097069-17386827612025-02-04t100005z_1240194748_rc2gkcaa919u_rtrmadp_0_usa-trump-kennedy-cassidy.jpeg?v=1738682809&w=1920&h=1080",
        "Industry": "Healthcare",
        "Company": "Pfizer",
        "TimePub": "2025-02-04T16:50:33Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Shares of vaccine companies fell on Tuesday after a Senate panel voted to advance Robert F. Kennedy Jr.'s nomination to lead the Department of Health and Human Services to the full chamber.  The committee voted 14 to 13 to advance Kennedy in a party-line vote around 10:30 a.m. ET. Moderna's stock closed about 6% lower and shares of BioNTech dropped nearly 2%. Pfizer's stock closed more than 1% lower, even after the company reported fourth-quarter results that topped expectations. Their shares initially fell by larger margins following the Senate committee vote, then regained some ground. Kennedy, 71, is a notorious vaccine skeptic, making false claims that they are linked to autism despite decades of studies that debunk that association. But Kennedy, during Senate confirmation hearings last week, contended that he is not \"anti-vaccine.\"  Kennedy is also the founder of the nonprofit Children's Health Defense, the most well-funded anti-vaccine organization in the U.S. In a government ethics agreement last month, he said he stopped serving as chairman or chief legal counsel for the organization as of December. If confirmed by the Senate, Kennedy would oversee federal health agencies that regulate vaccines and other drugs. Some health policy experts have raised concerns about Kennedy using his new potential platform to spread anti-vaccine rhetoric and deter Americans from receiving recommended shots at a time when vaccination rates are already falling, especially among children. During an industry conference in January, Pfizer CEO Albert Bourla said Kennedy's anti-vaccine rhetoric is in \"complete contradiction\" with what the company, regulators and the medical and scientific community believe. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "AbbVie_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Cramer's Lighting Round: AbbVie is a buy",
        "Author": null,
        "Description": "\"Mad Money\" host Jim Cramer rings the lightning round bell, which means he's giving his answers to callers' stock questions at rapid speed.",
        "URL": "https://www.cnbc.com/2025/02/04/cramers-lighting-round-abbvie-is-a-buy.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/103507374-104044814.jpg?v=1697237650&w=1920&h=1080",
        "Industry": "Healthcare",
        "Company": "AbbVie",
        "TimePub": "2025-02-05T00:00:10Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Monday - Friday, 6:00 - 7:00 PM ET MongoDB: \"You'd be catching it at the right time. I think the analysts are all starting to upgrade the, the enterprise software again. I think it's worth a stab, I really do. But it's a trade, not an investment.\" Tempus: \"I think Stryker's the better one. If you want AI, then you go with Medtronic.\" Coinbase: \"Just go buy the Bitcoin, will you...We don't want the Coinbase, we want the Bitcoin.\" AbbVie: \"AbbVie is just a gem...AbbVie is a winner, I can't believe the stock dropped so much. I think AbbVie is a buy.\" Cerence: \"Let's pull the trigger.\" Hims & Hers Health: \"This stock is a short squeeze.\" Click here to download Jim Cramer's Guide to Investing at no cost to help you build long-term wealth and invest smarter. Sign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market. Disclaimer Questions for Cramer? Call Cramer: 1-800-743-CNBC Want to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - Instagram Questions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "JPMorgan Chase_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Many workers would take a pay cut to work from home — some would forgo at least 20% of their salary",
        "Author": null,
        "Description": "Workers cite the work-life balance afforded by hybrid or fully remote jobs as the biggest benefit.",
        "URL": "https://www.cnbc.com/2025/02/07/many-workers-would-take-a-pay-cut-to-work-from-home.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108099378-1738951330179-gettyimages-1846540060-_dsc0406-editar.jpeg?v=1738951397&w=1920&h=1080",
        "Industry": "Financials",
        "Company": "JPMorgan Chase",
        "TimePub": "2025-02-07T19:21:06Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Many workers value remote work to such a degree that they'd take a pay cut to be able to work from home, even on a part-time basis, studies show. The prevalence of remote work ballooned during the Covid-19 pandemic. Many experienced telework perhaps for the first time in their careers; employees cite work-life balance as by far the biggest perceived benefit, according to Pew Research Center. Some researchers have quantified the financial value workers assign to telework. For example, about 40% of workers say they'd accept a pay cut of at least 5% to keep their remote job, according to a recent study by researchers at Harvard University, Johns Hopkins University and the University of Illinois at Urbana-Champaign. About 9% would trade at least 20% of their salaries to preserve telework, said researchers, who polled more than 2,000 workers. Put another way, workers see the ability to work from home — even two or three days a week — as equivalent to getting a raise, according to Nick Bloom, an economics professor at Stanford University who studies workplace management practices. Data that Bloom has collected in recent years suggests the average worker equates remote work to about an 8% raise, he said. \"That figure seems remarkably stable\" over time, Bloom said in an e-mail. \"For some subsets of workers you can find higher numbers,\" relative to the pay cut they would accept, Bloom said. For example, a National Bureau of Economic Research working paper published in January that looked at workers predominantly in the technology field found they'd accept an average 25% pay cut for a job that offers fully or partially remote work. \"The reality is: It is a very attractive feature of a job,\" said Zoe Cullen, an assistant professor of business administration at Harvard Business School, who co-authored the NBER research.   The paper examined data on almost 1,400 workers from the U.S. tech sector. The average person was 32 years old, and had about seven years of work experience. Researchers gathered data on the job offers individuals receive and the jobs they ultimately choose, with the average gig offering $239,000 a year in total compensation. More from Personal Finance:What the 'mother of all trade wars' can teach about tariffsL.A. wildfire victims face financial anxiety amid recoveryHow to check the status of your federal tax refund Of course, not all Americans prefer out-of-office work. About 41% of workers with the ability to telework — but who rarely do — say in-office work helps them feel more connected to co-workers, and 30% think in-person work helps with mentoring opportunities, according to Pew Research Center. Working from home has also waned from its pandemic-era peak. Big companies like Amazon, AT&T, Boeing, Dell Technologies, JPMorgan Chase, UPS and The Washington Post have initiated return-to-office mandates for at least some employees. President Donald Trump also issued an order Jan. 20 to terminate remote work for federal employees and require full-time in-office attendance, with some exceptions. That said, on a national scale, employers don't seem to be retrenching en masse, according to labor economists. The number of paid days worked from home during the workweek has held steady for the past two years, at between 25% and 30% — more than triple the pre-Covid rate, according to WFH Research. Employees aren't the only ones who get a benefit: Remote work is also a profitable arrangement for businesses, according to labor economists. For example, employers may save money on real estate by downsizing office space. They may also hire job candidates from across the country, potentially at a lower relative salary, depending on geography. Workers with the ability to work from home also tend to quit less frequently, thereby reducing company spending on expensive functions like hiring, recruitment and training, Bloom said. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "JPMorgan Chase_bloomberg.com_1",
        "Source": "Bloomberg",
        "Title": "Global markets to see a volatile year ahead; tariffs, inflation major drivers: JPMorgan",
        "Author": "Bloomberg",
        "Description": "JPMorgan survey predicts volatile year ahead due to inflation, tariffs, and geopolitical tension impacting global financial markets.",
        "URL": "https://www.bloomberg.com/news/articles/2025-02-06/tariffs-to-drive-global-markets-in-volatile-2025-jpmorgan-finds",
        "ImageURL": "https://bl-i.thgim.com/public/incoming/r2k7oa/article69083817.ece/alternates/LANDSCAPE_1200/PO26_Stock_chart.jpg",
        "Industry": "Financials",
        "Company": "JPMorgan Chase",
        "TimePub": "2025-02-06T09:00:50Z",
        "Summary": "Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Connecting decision makers to a dynamic network of information, people and ideas, Bloomberg quickly and accurately delivers business and financial information, news and insight around the world Americas+1 212 318 2000 EMEA+44 20 7330 7500 Asia Pacific+65 6212 1000 Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here. Global financial-market turbulence this week sparked by a series of US tariff announcements looks like just the beginning of a volatile year, according to a JPMorgan Chase & Co. electronic trading survey."
    },
    {
        "ArticleID": "Bank of America_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Temu parent PDD's stock tumbles as Trump tariffs close trade loophole",
        "Author": null,
        "Description": "PDD-owned budget online retailer Temu and its rival Shein have relied on de minimis to maintain their rock bottom prices.",
        "URL": "https://www.cnbc.com/2025/02/03/temu-parent-pdds-stock-tumbles-as-trump-tariffs-close-trade-loophole.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/107235368-1683182016352-gettyimages-1249593344-porzycki-temuphot230327_npbeP.jpeg?v=1738605320&w=1920&h=1080",
        "Industry": "Financials",
        "Company": "Bank of America",
        "TimePub": "2025-02-03T19:01:27Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Shares of Temu parent PDD Holdings closed down 5.9% on Monday, after President Donald Trump's tariffs announcement signaled the end of a trade loophole used by the Chinese e-commerce giant and other online retailers. Trump on Saturday signed executive orders imposing 25% tariffs on imports from Canada and Mexico, while adding an additional 10% levy on goods from China. Trump on Monday agreed to pause tariffs on Mexico for one month, while the import taxes remain in place for China and Canada. An overlooked provision in the orders eliminates the \"de minimis\" trade loophole relied on heavily by Chinese online retailers like PDD's Temu and Shein. The de minimis exemption allows packages worth less than $800 to be shipped into the U.S. duty free. It's been a critical tool for Temu and Shein as they look to grow their presence in the U.S. by offering rock-bottom prices on everything from clothes and furniture to electronics and home decor. Lawmakers have zeroed in on de minimis in recent years, arguing it gives Chinese companies an unfair advantage by allowing them to bypass tariffs. Officials have also said de minimis packages are \"subject to minimal documentation and inspection,\" raising product safety concerns. Trade organizations and advocacy groups have also pushed Trump to curb de minimis shipments because they argue that it has allowed shipments of fentanyl to enter the U.S. Without that tax advantage, it's unclear if Temu, Shein and other Chinese e-commerce platforms will be able to keep prices low and sustain the explosive growth they've seen in the U.S. in recent years. Temu and Shein have previously said their business models don't rely on de minimis. Shein and Temu have opened distribution centers in the U.S., allowing sellers in China to ship goods to the U.S. and store them in local warehouses. It's more in line with Amazon's logistics network, which spans hundreds of warehouses across the U.S. That may not be enough to soften the blow of the removal of de minimis. In a note to clients on Sunday, analysts at Citi estimated Temu's local warehouse program remains a small portion of its overall business. \"Although Temu's efforts in ramping up its local warehouse/semi-managed model over the past year could help mitigate some of the tariff risks, we estimate the [gross merchandise volume] from local warehouses might have contributed 20%+ to U.S. GMV by end-2024,\" the analysts wrote. They added, \"We believe the new tariffs will still have a negative read-through to Temu's growth in 2025 and beyond.\" The end of de minimis could also dampen Temu and Shein's digital ad spending, as they look to \"offset concerns on rising product costs,\" Bank of America analysts wrote Monday in a note to clients. Shein and Temu have been significant contributors to Meta's advertising revenue in recent quarters. The companies have gone on a digital marketing blitz in an attempt to reach more American consumers. \"Meta's 10-K indicates that revenue from China-based advertisers represented 11% of Family of Apps revenue (vs 6% in 2023), and we estimate Temu and Shein exposure could be 2-4% of ad spend for Google and Meta,\" the Bank of America analysts wrote. WATCH: Tariffs' toll on e-commerce Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Wells Fargo_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Stocks bounce back, plus Wells Fargo and its CEO Charlie Scharf get another win",
        "Author": null,
        "Description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "URL": "https://www.cnbc.com/2025/02/04/stocks-bounce-back-wells-fargo-and-ceo-charlie-scharf-get-another-win.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108097145-17386872342025-02-04t163551z_410372065_rc2rncaqoglk_rtrmadp_0_usa-fed-wellsfargo.jpeg?v=1738687262&w=1920&h=1080",
        "Industry": "Financials",
        "Company": "Wells Fargo",
        "TimePub": "2025-02-04T19:45:12Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Every weekday, the CNBC Investing Club with Jim Cramer releases the Homestretch — an actionable afternoon update, just in time for the last hour of trading on Wall Street. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "ConocoPhillips_cnbc.com_1",
        "Source": "CNBC",
        "Title": "We are changing our rating on Starbucks and looking to lock in some profits",
        "Author": null,
        "Description": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
        "URL": "https://www.cnbc.com/2025/02/05/we-are-changing-our-rating-on-starbucks-and-looking-to-lock-in-profits.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108093809-1738098503690-gettyimages-2193347521-AFP_36TV3AA.jpeg?v=1738101275&w=1920&h=1080",
        "Industry": "Energy",
        "Company": "ConocoPhillips",
        "TimePub": "2025-02-05T19:42:08Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Every weekday, the CNBC Investing Club with Jim Cramer releases the Homestretch — an actionable afternoon update, just in time for the last hour of trading on Wall Street. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "NextEra Energy_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Cramer's Lightning Round: NextEra Energy is a buy",
        "Author": null,
        "Description": "\"Mad Money\" host Jim Cramer rings the lightning round bell, which means he's giving his answers to callers' stock questions at rapid speed.",
        "URL": "https://www.cnbc.com/2025/02/06/cramers-lightning-round-nextera-energy-is-a-buy.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/102086255-mad-money-lightning.jpg?v=1698102997&w=1920&h=1080",
        "Industry": "Energy",
        "Company": "NextEra Energy",
        "TimePub": "2025-02-07T00:50:47Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Monday - Friday, 6:00 - 7:00 PM ET NextEra Energy: \"I like them...I think you've got a good one. [buy, buy, buy!]\" Fastly: \"No. I mean, they've missed the quarter too often. If you want to be in that, you want to be in Cloudflare.\" Danaher: \"Danaher's been bad for me...That last quarter was terrible, and, frankly, they were very smug on the call talking about how good it was, and that was a very ill-advised strategy that they adopted, and I don't like it.\" IES Holdings: \"That's Jeffrey Gendell's company. He is a, just an amazing man.\" SLB: \"It's the best house in a bad neighborhood, and we don't want to be in bad neighborhoods...Really great company, but I don't want to recommend the stock.\" A10 Networks: \"A10 is up in a straight line, it's a parabolic move. It's a good company, but I can't recommend parabolic stocks. Let that one come in.\" Click here to download Jim Cramer's Guide to Investing at no cost to help you build long-term wealth and invest smarter. Sign up now for the CNBC Investing Club to follow Jim Cramer's every move in the market. Disclaimer Questions for Cramer? Call Cramer: 1-800-743-CNBC Want to take a deep dive into Cramer's world? Hit him up! Mad Money Twitter - Jim Cramer Twitter - Facebook - Instagram Questions, comments, suggestions for the \"Mad Money\" website? madcap@cnbc.com Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Tesla_cnbc.com_1",
        "Source": "CNBC",
        "Title": "Uber opens 'interest list' for Waymo robotaxi rides in Austin",
        "Author": null,
        "Description": "Uber and Waymo beat Tesla to the punch offering robotaxi rides in Austin, Texas",
        "URL": "https://www.cnbc.com/2025/02/05/uber-opens-interest-list-for-waymo-robotaxi-rides-in-austin.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108090609-1737562946927-1U8A1356.JPG?v=1737563128&w=1920&h=1080",
        "Industry": "Consumer Discretionary",
        "Company": "Tesla",
        "TimePub": "2025-02-05T11:35:04Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article Ride-hailing and food delivery app Uber is opening its \"interest list\" to users in Austin, Texas, who want to be first in line for Waymo robotaxis there. The company said in a statement that users will \"be able to travel across 37 square miles of Austin — from Hyde Park, to Downtown, to Montopolis\" — when the Uber-Waymo service launches soon. The list allows users to receive Uber updates and bolsters their odds of being matched with a Waymo autonomous vehicle upon launch. The vehicles that will be part of the Austin service are Jaguar i-Pace electric models equipped with Waymo's driverless systems and labeled with both Waymo and Uber branding. The Waymo rides in Austin will only be available through the Uber app, unlike in San Francisco and Los Angeles, where riders hail them through the Waymo One app. Uber faced investor pressure last year to step up its autonomous vehicle strategy after Tesla promised it would soon start producing robotaxis, and had begun testing a ride-hailing app with some of its employees. While Tesla does not make vehicles that are safe to use without a human driver at the wheel, ready to steer or brake at all times, Elon Musk's automaker in January said it will \"begin launching\" a driverless ride-hailing business \"later this year\" starting in Austin. According to the Texas Department of Transportation, testing and operating a commercial robotaxi service in the state does not require the same types of special licenses and permits that other states require. \"Texas law allows for AV testing and operations on Texas roadways as long as they meet the same safety and insurance requirements as every other vehicle on the road,\" a spokesperson for the department told CNBC by email. Uber reported revenue growth for the fourth quarter of 20% on Wednesday, topping analysts' estimates. But the stock slid as the company issued weak bookings guidance for the first quarter.  Correction: A prior version of this story had an incorrect detail about Uber's ride-hailing app. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Tesla_apnews.com_1",
        "Source": "Associated Press",
        "Title": "Elon Musk says President Donald Trump has 'agreed' USAID should be shut down",
        "Author": "By ELLEN KNICKMEYER - Associated Press",
        "Description": "Early Monday, billionaire Trump advisor Elon Musk held a live session on X Spaces, previously known as Twitter Spaces, and said that he spoke in detail about USAID with the president. The Trump administration has already placed two top security…",
        "URL": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611",
        "ImageURL": "https://bloximages.chicago2.vip.townnews.com/thesunchronicle.com/content/tncms/assets/v3/editorial/6/19/619f5568-f736-5e55-bb42-65b9906d06e6/6798478c8ee38.image.jpg?crop=1762%2C925%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
        "Industry": "Consumer Discretionary",
        "Company": "Tesla",
        "TimePub": "2025-02-03T07:26:00Z",
        "Summary": "Copyright 2025 The Associated Press. All Rights Reserved. USAID humanitarian aid destined for Venezuela is displayed for the media at a warehouse next to the Tienditas International Bridge on the outskirts of Cucuta, Colombia, Feb. 19, 2019. (AP Photo/Fernando Vergara, File) A man walks past boxes of USAID humanitarian aid at a warehouse at the Tienditas International Bridge on the outskirts of Cucuta, Colombia, Feb. 21, 2019, on the border with Venezuela. (AP Photo/Fernando Vergara)     WASHINGTON (AP) — The U.S. Agency for International Development is on the cusp of being shuttered, according the Trump administration’s billionaire adviser and Tesla CEO Elon Musk — who has been wrestling for control of the agency in recent days.  Early Monday, Musk held a live session on X Spaces, previously known as Twitter Spaces, and said that he spoke in detail about USAID with the president. “He agreed we should shut it down,” Musk said. “It became apparent that its not an apple with a worm it in,” Musk said. “What we have is just a ball of worms. You’ve got to basically get rid of the whole thing. It’s beyond repair.” “We’re shutting it down.” His comments come after the administration placed two top security chiefs at USAID on leave after they refused to turn over classified material in restricted areas to Musk’s government-inspection teams, a current and a former U.S. official told The Associated Press on Sunday. Members of Musk’s Department of Government Efficiency, known as DOGE, eventually did gain access Saturday to the aid agency’s classified information, which includes intelligence reports, the former official said. Musk’s DOGE crew lacked high enough security clearance to access that information, so the two USAID security officials — John Voorhees and deputy Brian McGill — believed themselves legally obligated to deny access. The current and former U.S. officials had knowledge of the incident and spoke on condition of anonymity because they were not authorized to share the information. \n Musk on Sunday responded to an X post about the news by saying, “USAID is a criminal organization. Time for it to die.” He followed with additional posts on X about the aid agency.  Kate Miller, who serves on an advisory board for DOGE, said in a separate post that no classified material was accessed “without proper security clearances.” It comes a day after DOGE carried out a similar operation at the Treasury Department, gaining access to sensitive information including the Social Security and Medicare customer payment systems. The Washington Post reported that a senior Treasury official had resigned over Musk’s team accessing sensitive information. Musk formed DOGE in cooperation with the Trump administration with the stated goal of finding ways to fire federal workers, cut programs and slash federal regulations. USAID, whose website vanished Saturday without explanation, has been one of the federal agencies most targeted by the Trump administration in an escalating crackdown on the federal government and many of its programs. “It’s been run by a bunch of radical lunatics. And we’re getting them out,” Trump said to reporters about USAID on Sunday night.  The Trump administration and Secretary of State Marco Rubio have imposed an unprecedented freeze on foreign assistance that has shut down much of USAID’s humanitarian, development and security programs worldwide — compelling thousands of layoffs by aid organizations — and ordered furloughs and leaves that have gutted the agency’s leadership and staff in Washington. The U.S. is by far the world’s largest donor of humanitarian aid, with USAID administering billions of dollars in humanitarian, development and security assistance in more than 100 countries.  Peter Marocco, a returning political appointee from Trump’s first term, was a leader in enforcing the shutdown. USAID staffers say they believe that agency outsiders with visitors badges asking questions of employees inside the Washington headquarters are members of Musk’s DOGE team. Democratic Sen. Elizabeth Warren said in a post on Sunday that Trump was allowing Musk to access people’s personal information and shut down government funding.  “We must do everything in our power to push back and protect people from harm,” the Massachusetts senator said, without giving details. Associated Press writers Michelle L. Price in New York, Matthew Lee in Panama City and Fatima Hussein in Washington contributed to this report. ___ This story has been updated to correct the surname name of one of the USAID security officials. He is John Voorhees, not John Vorhees.   \n Copyright 2025 The Associated Press. All Rights Reserved."
    },
    {
        "ArticleID": "McDonald's_cnbc.com_1",
        "Source": "CNBC",
        "Title": "McDonald's Shamrock Shake returns — and so does Grimace's uncle",
        "Author": null,
        "Description": "McDonald's is bringing back the mascot Uncle O'Grimacey, Grimace's uncle, to promote the seasonal milkshake.",
        "URL": "https://www.cnbc.com/2025/02/04/mcdonalds-shamrock-shake-returns-with-uncle-ogrimacey.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/103475345-100_Shamrock-Shake.jpg?v=1529470982&w=1920&h=1080",
        "Industry": "Consumer Discretionary",
        "Company": "McDonald's",
        "TimePub": "2025-02-04T13:30:02Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  In this article McDonald's is leaning on customers' nostalgia for its McDonaldland characters to spur sales of its Shamrock Shake. The company said Tuesday that Grimace will reunite with his Irish uncle, Uncle O'Grimacey, unretiring the mascot after decades out of the spotlight. McDonald's originally created Uncle O'Grimacey in 1975 to promote the Shamrock Shake, but he hasn't been seen since the mid-1980s. The Shamrock Shake, a seasonal staple for more than 50 years, returns to U.S. restaurants annually before St. Patrick's Day. The milkshake comes back on Feb. 10. This year, 25 cents of every Shamrock Shake sale will go toward the Ronald McDonald House Charities. That same day the shake relaunches, the fast-food giant is expected to report its fourth-quarter results. McDonald's sales have struggled to bounce back since the Centers for Disease Control and Prevention linked its Quarter Pounder burgers to a fatal E. coli outbreak in October, even after the health agency declared the crisis over. A viral moment, like the return of Uncle O'Grimacey, could boost traffic to its restaurants and lift sales out of their slump. Uncle O'Grimacey's reappearance marks the third time since the viral Grimace Birthday Meal that the chain has used its retro mascots in marketing. The company named its beverage-focused spinoff brand CosMc's, after the McDonald's-loving alien that appeared in ads decades ago. And when McDonald's launched its \"Best Burger\" initiative to spread the word about changes to its cheeseburgers and Big Macs, the company sent the Hamburglar on a cross-country tour. But Grimace remains the star. His birthday meal, complete with a purple milkshake, helped McDonald's quarterly U.S. same-store sales climb more than 10% in the spring of 2023. And Grimace has held onto the public's adoration. Last year, he became a good luck charm for the New York Mets during the professional baseball team's most recent season. After Grimace threw out the first pitch before a June game, the Mets went on a winning streak, which led the mascot to appear at games through the team's playoff push. Uncle O'Grimacey disappeared after the company dialed back its use of the McDonaldland mascots. However, a rumor circulated the internet in recent years, saying that Uncle O'Grimacey wasn't used publicly after an actor playing the mascot in Philadelphia made comments in support of the Irish Republican Army; there's no evidence to suggest that the incident actually happened. Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    },
    {
        "ArticleID": "Nike_cnbc.com_1",
        "Source": "CNBC",
        "Title": "NFL goes after Gen Z fans by courting creators on YouTube, Instagram and Snapchat",
        "Author": null,
        "Description": "Hundreds of creators have swarmed New Orleans for Super Bowl 59, getting paid big contracts to make content for brands like Microsoft, Verizon and Nike.",
        "URL": "https://www.cnbc.com/2025/02/07/nfl-goes-after-gen-z-fans-by-courting-social-media-content-creators.html",
        "ImageURL": "https://image.cnbcfm.com/api/v1/image/108098803-1738872529516-IMG_4732.jpeg?v=1738874409&w=1920&h=1080",
        "Industry": "Consumer Discretionary",
        "Company": "Nike",
        "TimePub": "2025-02-07T13:00:01Z",
        "Summary": "Credit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECT All Credit Cards Find the Credit Card for You Best Credit Cards Best Rewards Credit Cards Best Travel Credit Cards Best 0% APR Credit Cards Best Balance Transfer Credit Cards Best Cash Back Credit Cards Best Credit Card Welcome Bonuses Best Credit Cards to Build Credit SELECT All Loans Find the Best Personal Loan for You Best Personal Loans Best Debt Consolidation Loans Best Loans to Refinance Credit Card Debt Best Loans with Fast Funding Best Small Personal Loans Best Large Personal Loans Best Personal Loans to Apply Online Best Student Loan Refinance SELECT All Banking Find the Savings Account for You Best High Yield Savings Accounts Best Big Bank Savings Accounts Best Big Bank Checking Accounts Best No Fee Checking Accounts No Overdraft Fee Checking Accounts Best Checking Account Bonuses Best Money Market Accounts Best CDs Best Credit Unions SELECT All Mortgages Best Mortgages Best Mortgages for Small Down Payment Best Mortgages for No Down Payment Best Mortgages with No Origination Fee Best Mortgages for Average Credit Score Adjustable Rate Mortgages Affording a Mortgage SELECT All Insurance Best Life Insurance Best Homeowners Insurance Best Renters Insurance Best Car Insurance Travel Insurance SELECT All Credit Monitoring Best Credit Monitoring Services Best Identity Theft Protection How to Boost Your Credit Score Credit Repair Services SELECT All Personal Finance Best Budgeting Apps Best Expense Tracker Apps Best Money Transfer Apps Best Resale Apps and Sites Buy Now Pay Later (BNPL) Apps Best Debt Relief SELECT All Small Business Best Small Business Savings Accounts Best Small Business Checking Accounts Best Credit Cards for Small Business Best Small Business Loans Best Tax Software for Small Business SELECT All Taxes Filing For Free Best Tax Software Best Tax Software for Small Businesses Tax Refunds Tax Brackets Tax Tips Tax By State Tax Payment Plans SELECT All Help for Low Credit Scores Best Credit Cards for Bad Credit Best Personal Loans for Bad Credit Best Debt Consolidation Loans for Bad Credit Personal Loans if You Don't Have Credit Best Credit Cards for Building Credit Personal Loans for 580 Credit Score or Lower Personal Loans for 670 Credit Score or Lower Best Mortgages for Bad Credit Best Hardship Loans How to Boost Your Credit Score SELECT All Investing Best IRA Accounts Best Roth IRA Accounts Best Investing Apps Best Free Stock Trading Platforms Best Robo-Advisors Index Funds Mutual Funds ETFs Bonds  Katie Austin normally publishes fitness content to her Instagram and YouTube channel. But this week, she's been posting a steady trickle of content from New Orleans. That's because Austin, 31, from California, is one of hundreds of creators who have swarmed the Big Easy for Super Bowl 59, getting paid large contracts to make social media content for big-name brands like Electronic Arts and Nike. Austin was sent to New Orleans this week by Snap and the NFL to give her fans a behind-the-scenes look at the Super Bowl. She's also involved in integrations around the games with brands like Microsoft and Verizon, for whom she is hosting a promotional fan event. \"I can reach a lot of people myself,\" said Austin, who has about 2 million followers across all platforms. \"So sending a creator like me to an experience, I am engaging my followers to get that awareness.\" As the 2024 NFL season concludes, viewership and engagement among Generation Z and Generation Alpha has hit a record high, according to the NFL. Austin's role underscores a new reality where online creators are treated just like traditional celebrities, in an attempt to attract younger audiences to football. The NFL has made this push in partnership with social apps like YouTube and Snapchat, highlighting the league's evolving marketing strategies that are increasingly focused on digitally native audiences. \"You start to look at these different cohorts of fans, especially the ones that are a little more difficult to reach through linear and you start to see the role in which creators can play and broaden that audience,\" said Ian Trombetta, NFL senior vice president of social, influencer and creator marketing.  For this year's Super Bowl, featuring the Kansas City Chiefs and Philadelphia Eagles, brands like Nike and EA are sponsoring creators to attend the event and post content. Austin didn't say how much she's getting paid for the content she's making at Super Bowl 59, but some brands have signed deals of up to six figures with some creators to promote the event, said Victoria Bachan, global president of Sixteenth, a creator talent management company. \"You can no longer really have a media strategy for tentpole opportunities like this that do not include a creator level,\" said Bachan. Brands are increasing their spending on influencer activations for this year's Super Bowl between 25% and 35%, and they're diverting funds from traditional TV-only advertising to do so, according to a study by Captiv8, an influencer marketing platform. The push for creators comes after concerns about younger audiences' lack of interest in sports had grown. A 2022 Emory Goizueta Business School study found that 27% of Gen Z identify as \"anti-sports,\" compared with 7% of millennials and 5% of Generation X. The NFL's push to engage creators, which began in 2019, has already paid off. The percentage of Gen Z and Gen A who identify as fans has grown steadily for the last three years to an all-time high as the league's investment in creators has grown, according to the NFL. Besides Austin, Snapchat sent a handful of other creators to the Super Bowl to post behind-the-scenes content using augmented reality filters. Meanwhile, YouTube, which secured a $2 billion-per-year deal for the rights to \"NFL Sunday Ticket\" in 2022, has established itself as pivotal to connecting the league with digital audiences. This year, YouTube will debut as the first official sponsor of the Super Bowl Tailgate, which will feature events with top creators like Kristy and Desmond Scott and a livestreamed performance by rapper Post Malone before the game on Sunday. To adapt to these changes, the NFL has eased up on restrictions around the use of official league footage by creators on their YouTube channels.  The league and YouTube in January expanded their \"Access Pass\" program to allow retired NFL players like Cam Newton, Jason Kelce and Kurt Benkert to use league footage in their videos.  \"There's this pathway now that certainly did not exist five to 10 years ago,\" Trombetta said. \"It's really cool especially as these athletes showcase more of their personalities off the field.\" WATCH: Meta the 'most consequential' company in the world: Futurum CEO Got a confidential news tip? We want to hear from you. Sign up for free newsletters and get more CNBC delivered to your inbox Get this delivered to your inbox, and more info about our products and services. © 2025 CNBC LLC. All Rights Reserved. A Division of NBCUniversal \n      Data is a real-time snapshot *Data is delayed at least 15 minutes.\n      Global Business and Financial News, Stock Quotes, and Market Data\n      and Analysis.\n     Data also provided by"
    }
]